{
    "Day1": {
      "Morning": {
        "Name": "Imperial Palace and East Garden",
        "Description": "Explore the serene and historic Imperial Palace, the primary residence of the Emperor of Japan. The East Garden, part of the inner palace area, offers a peaceful retreat with beautiful landscaping, including remnants of the old Edo Castle.",
        "Transport": "JR Yamanote Line or Tokyo Metro to Tokyo Station, then a short walk.",
        "Image": "https://www.fodors.com/assets/destinations/708683/paths-imperial-palace-east-garden-tokyo-japan_main.jpg"
      },
      "Afternoon": {
        "Name": "Yasukuni Shrine and Kagurazaka",
        "Description": "Visit Yasukuni Shrine, a Shinto shrine dedicated to the spirits of those who died in service to Japan. Afterwards, stroll through Kagurazaka, a district known for its blend of traditional and modern Japanese culture, narrow alleys, and upscale dining.",
        "Transport": "Tokyo Metro to Kudanshita Station, then walk.",
        "Image": "https://media.tacdn.com/media/attractions-splice-spp-674x446/0b/27/82/17.jpg"
      },
      "Evening": {
        "Name": "Odaiba Seaside Park",
        "Description": "Relax at Odaiba Seaside Park, offering beautiful views of Tokyo Bay and the Rainbow Bridge. It's a great spot for sunset. Later, explore the shopping and entertainment options in Palette Town, including VenusFort, a Venice-themed shopping mall.",
        "Transport": "Yurikamome Line to Odaiba Kaihin Koen Station.",
        "Image": "https://a1.cdn.japantravel.com/photo/poi-523-230622/800/tokyo-odaiba-marine-park-230622.jpg"
      }
    },
    "Day2": {
      "Morning": {
        "Name": "Mori Art Museum",
        "Description": "Visit Roppongi Hills, a modern urban center with shops, restaurants, and the Mori Art Museum. The museum, located at the top of the Mori Tower, offers contemporary art exhibitions and stunning views of the city.",
        "Transport": "Tokyo Metro to Roppongi Station.",
        "Image": "https://worldartfoundations.com/wp-content/uploads/2019/07/Mori.jpg"
      },
      "Afternoon": {
        "Name": "Nezu Museum",
        "Description": "Discover the Nezu Museum, known for its collection of Asian art and a beautifully landscaped Japanese garden. Then, take a leisurely stroll down Omotesando, a broad tree-lined avenue home to fashionable boutiques and architectural wonders.",
        "Image": "https://www.gotokyo.org/en/spot/1/images/1_0001_3_1400x1100.jpg"
      },
      "Evening": {
        "Name": "Tokyo Tower",
        "Description": "Marvel at the panoramic night views of Tokyo from Tokyo Tower, an iconic symbol of the city. The tower's observation decks provide a breathtaking experience.",
        "Transport": "Short walk or a quick taxi ride from Omotesando.",
        "Image": "https://media.tacdn.com/media/attractions-splice-spp-674x446/0b/27/61/f1.jpg"
      }
    },
    "Day3": {
      "Morning": {
        "Name": "Koishikawa Korakuen Gardens",
        "Description": "Visit Koishikawa Korakuen, one of Tokyo's oldest and most beautiful traditional landscape gardens. It features classic elements of Chinese and Japanese garden design, offering a tranquil escape from the city's hustle and bustle.",
        "Transport": "JR Chuo Line or Tokyo Metro to Iidabashi Station, then a short walk.",
        "Image": "https://www.japan-guide.com/g18/3034_003_01.jpg"
      },
      "Afternoon": {
        "Name": "Ikebukuro Exploration",
        "Description": "Ikebukuro, a bustling commercial and entertainment district, is known for its shopping options at places like Sunshine City, a large complex that includes an aquarium and observatory.",
        "Transport": "JR Yamanote Line to Ikebukuro Station.",
        "Image": "https://www.gotokyo.org/tc/destinations/northern-tokyo/ikebukuro/images/area012_0995_2.jpg"
      },
      "Evening": {
        "Name": "Inokashira Park and Kichijoji",
        "Description": "Conclude your day at Inokashira Park, a spacious public park with a large pond, perfect for a relaxing stroll. Later, explore the vibrant neighborhood of Kichijoji, known for its trendy shops, cozy cafes, and small izakayas.",
        "Transport": "JR Chuo Line to Kichijoji Station, then a short walk.",
        "Image": "https://cdn.tohokuandtokyo.org/front_assets/images_other/spot/middle/kichijoji4.jpg"
      }
    }
  }
  